Calendar/sentiment.org
#+OPTIONS: <:active
#+ICALENDAR_EXCLUDE_TAGS:
#+SETUPFILE: ../configOrg/level1.org

* work plan
SCHEDULED: <2017-07-19 Wed>
** DONE 搭建基金策略
CLOSED: [2017-07-26 Wed 10:10]
- [ ] 对基金策略进行组合优化
- [ ] 分析优化后结果，把组合优化加入流程
* work plan
SCHEDULED: <2017-07-21 Fri>
** DONE 配置好GOOGLE GCLOUD PLATORM的代理
CLOSED: [2017-07-26 Wed 10:10]
** DONE 利用本地PYTHON处理一下中文数据提取SENSITIVITY数据。
CLOSED: [2017-07-26 Wed 10:10]
** DONE deep learning of bank stress in the news
CLOSED: [2017-07-26 Wed 10:10]
** DONE detect events based on text, obtain descriptions of events.
CLOSED: [2017-07-26 Wed 10:10]

** DONE GOOGLE NLP SDK试用，只能用PYTHON2.7，而且内容是从本地传输到GOOGLE 云计算服务，在传输过程中遇到代理麻烦，无法返回结果。
CLOSED: [2017-07-26 Wed 10:10]

** DONE configuration:
CLOSED: [2017-07-26 Wed 10:10]
- reports-174211
- proxy:
127.0.0.1:1080

- [X] Make sure that Python 2.7.9 or later is installed on your system.
- [X] ./google-cloud-sdk/install.sh
- [X] ./google-cloud-sdk/bin/gcloud init
- [X] pip install --upgrade google-cloud-language
- [X] export GOOGLE_APPLICATION_CREDENTIALS=/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json
- [X] gcloud auth activate-service-account --key-file=/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json
- [X] example:
#+BEGIN_SRC python
# auth
from google.oauth2 import service_account

credentials = service_account.Credentials.from_service_account_file(
    '/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json')

scoped_credentials = credentials.with_scopes(
    ['https://wwwc.googleapis.com/auth/cloud-platform'])

#+END_SRC
#+BEGIN_SRC python
# -*- coding: utf-8 -*-
# Imports the Google Cloud client library
from google.cloud import language

# Instantiates a client
language_client = language.Client()

# The text to analyze
text = 'Hello, world!'
#text = u'正在按照第一个网页流程走'
document = language_client.document_from_text(text)

# Detects the sentiment of the text
sentiment = document.analyze_sentiment().sentiment

print('Text: {}'.format(text))
print('Sentiment: {}, {}'.format(sentiment.score, sentiment.magnitude))

#+END_SRC

- https://github.com/GoogleCloudPlatform/python-docs-samples/tree/master/language/movie_nl

- GCLOUD example:
#+BEGIN_SRC shell
gcloud ml language analyze-entities --content="Michelangelo Caravaggio, Italian painter, is known for 'The Calling of Saint Matthew'."
#+END_SRC

** DONE SDK
CLOSED: [2017-07-26 Wed 10:11]
- https://cloud.google.com/sdk/docs/quickstart-linux
- key:
https://console.cloud.google.com/iam-admin/serviceaccounts/project?project=reports-174211
- 初始化SDK
  - 配置网络代理
  - 输入代理IP地址:127.0.0.1，代理端口：1080
- 授权SDK
  - gcloud auth application-default login

- auth
https://developers.google.com/identity/protocols/application-default-credentials
#+BEGIN_SRC json


#+END_SRC

- gcloud config list
#+BEGIN_SRC shell
(C:\Users\gft\Anaconda2) C:\Users\gft\Documents\Python Scripts\sentiment>gcloud
config list
[compute]
region = us-east1
zone = us-east1-d
[core]
account = victor.wuv@gmail.com
disable_usage_reporting = False
project = reports-174211
[proxy]
address = 192.168.1.164
port = 1080
type = http

Your active configuration is: [nlp1]

(C:\Users\gft\Anaconda2) C:\Users\gft\Documents\Python Scripts\sentiment>
#+END_SRC

* work plan
SCHEDULED: <2017-07-24 Mon>
