docs/Calendar/sentiment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-09 Mon 13:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">work plan</a>
<ul>
<li><a href="#orgheadline2"><span class="done DONE">DONE</span> 搭建基金策略</a></li>
</ul>
</li>
<li><a href="#orgheadline3">work plan</a>
<ul>
<li><a href="#orgheadline4"><span class="done DONE">DONE</span> 配置好GOOGLE GCLOUD PLATORM的代理</a></li>
<li><a href="#orgheadline5"><span class="done DONE">DONE</span> 利用本地PYTHON处理一下中文数据提取SENSITIVITY数据。</a></li>
<li><a href="#orgheadline6"><span class="done DONE">DONE</span> deep learning of bank stress in the news</a></li>
<li><a href="#orgheadline7"><span class="done DONE">DONE</span> detect events based on text, obtain descriptions of events.</a></li>
<li><a href="#orgheadline8"><span class="done DONE">DONE</span> GOOGLE NLP SDK试用，只能用PYTHON2.7，而且内容是从本地传输到GOOGLE 云计算服务，在传输过程中遇到代理麻烦，无法返回结果。</a></li>
<li><a href="#orgheadline9"><span class="done DONE">DONE</span> configuration:</a></li>
<li><a href="#orgheadline10"><span class="done DONE">DONE</span> SDK</a></li>
</ul>
</li>
<li><a href="#orgheadline11">work plan</a>
<ul>
<li><a href="#orgheadline12"><span class="done DONE">DONE</span> Hidden factor model</a></li>
<li><a href="#orgheadline13"><span class="done DONE">DONE</span> connect to Amazon AWS EW2:</a></li>
</ul>
</li>
<li><a href="#orgheadline14">work plan</a>
<ul>
<li><a href="#orgheadline15"><span class="done DONE">DONE</span> read the book 《自然语言处理综论》</a></li>
<li><a href="#orgheadline16"><span class="done DONE">DONE</span> listen to the open course</a></li>
<li><a href="#orgheadline17"><span class="done DONE">DONE</span> 寻找中文分词开源项目</a></li>
<li><a href="#orgheadline18"><span class="todo TODO">TODO</span> Structure:</a></li>
<li><a href="#orgheadline19"><span class="todo TODO">TODO</span> Opinion Mining, Sentiment Analysis, and Opinion Spam Detection</a></li>
<li><a href="#orgheadline20"><span class="todo TODO">TODO</span> 目标学习：信息抽取</a></li>
<li><a href="#orgheadline21">如何在NLP领域快速学会第一个技能？</a></li>
<li><a href="#orgheadline22">词性标记集：LTP中采用863词性标注集，其各个词性含义如下表：</a></li>
<li><a href="#orgheadline23">命名实体识别</a></li>
<li><a href="#orgheadline24">依存句法分析</a></li>
<li><a href="#orgheadline25">语义角色标注</a></li>
</ul>
</li>
<li><a href="#orgheadline26"><span class="todo TODO">TODO</span> Finish Sentiment book</a></li>
<li><a href="#orgheadline27"><span class="done DONE">DONE</span> factor exposure with CVXPY model</a>
<ul>
<li><a href="#orgheadline28">Classical (Markowitz) portfolio optimization</a></li>
<li><a href="#orgheadline29">Portfolio constraints</a></li>
<li><a href="#orgheadline30">Multi-Period Trading via Convex Optimization</a></li>
</ul>
</li>
<li><a href="#orgheadline32"><span class="todo TODO">TODO</span> 在GS上部署因子中性, CVXPORTOLIO的使用说明。</a>
<ul>
<li><a href="#orgheadline31">Multi-Period optimization</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">work plan</h2>
<div class="outline-text-2" id="text-orgheadline1">
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="done DONE">DONE</span> 搭建基金策略</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 对基金策略进行组合优化</li>
<li class="off"><code>[&#xa0;]</code> 分析优化后结果，把组合优化加入流程</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">work plan</h2>
<div class="outline-text-2" id="text-orgheadline3">
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="done DONE">DONE</span> 配置好GOOGLE GCLOUD PLATORM的代理</h3>
<div class="outline-text-3" id="text-orgheadline4">
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="done DONE">DONE</span> 利用本地PYTHON处理一下中文数据提取SENSITIVITY数据。</h3>
<div class="outline-text-3" id="text-orgheadline5">
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="done DONE">DONE</span> deep learning of bank stress in the news</h3>
<div class="outline-text-3" id="text-orgheadline6">
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="done DONE">DONE</span> detect events based on text, obtain descriptions of events.</h3>
<div class="outline-text-3" id="text-orgheadline7">
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="done DONE">DONE</span> GOOGLE NLP SDK试用，只能用PYTHON2.7，而且内容是从本地传输到GOOGLE 云计算服务，在传输过程中遇到代理麻烦，无法返回结果。</h3>
<div class="outline-text-3" id="text-orgheadline8">
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="done DONE">DONE</span> configuration:</h3>
<div class="outline-text-3" id="text-orgheadline9">
<ul class="org-ul">
<li>reports-174211</li>
<li>proxy:</li>
</ul>
<p>
127.0.0.1:1080
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Make sure that Python 2.7.9 or later is installed on your system.</li>
<li class="on"><code>[X]</code> ./google-cloud-sdk/install.sh</li>
<li class="on"><code>[X]</code> ./google-cloud-sdk/bin/gcloud init</li>
<li class="on"><code>[X]</code> pip install &#x2013;upgrade google-cloud-language</li>
<li class="on"><code>[X]</code> export GOOGLE<sub>APPLICATION</sub><sub>CREDENTIALS</sub>=/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json</li>
<li class="on"><code>[X]</code> gcloud auth activate-service-account &#x2013;key-file=/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json</li>
<li class="on"><code>[X]</code> example:</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">auth</span>
<span style="color: #F92672;">from</span> google.oauth2 <span style="color: #F92672;">import</span> service_account

<span style="color: #FD971F;">credentials</span> = service_account.Credentials.from_service_account_file<span style="color: #AE81FF;">(</span>
    <span style="color: #E6DB74;">'/home/weiwu/projects/sentiment/reports-b56f3f2275a1.json'</span><span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">scoped_credentials</span> = credentials.with_scopes<span style="color: #AE81FF;">(</span>
    <span style="color: #66D9EF;">[</span><span style="color: #E6DB74;">'https://wwwc.googleapis.com/auth/cloud-platform'</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">-*- coding: utf-8 -*-</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Imports the Google Cloud client library</span>
<span style="color: #F92672;">from</span> google.cloud <span style="color: #F92672;">import</span> language

<span style="color: #75715E;"># </span><span style="color: #75715E;">Instantiates a client</span>
<span style="color: #FD971F;">language_client</span> = language.Client<span style="color: #AE81FF;">()</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">The text to analyze</span>
<span style="color: #FD971F;">text</span> = <span style="color: #E6DB74;">'Hello, world!'</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">text = u'&#27491;&#22312;&#25353;&#29031;&#31532;&#19968;&#20010;&#32593;&#39029;&#27969;&#31243;&#36208;'</span>
<span style="color: #FD971F;">document</span> = language_client.document_from_text<span style="color: #AE81FF;">(</span>text<span style="color: #AE81FF;">)</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Detects the sentiment of the text</span>
<span style="color: #FD971F;">sentiment</span> = document.analyze_sentiment<span style="color: #AE81FF;">()</span>.sentiment

<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Text: {}'</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>text<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Sentiment: {}, {}'</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>sentiment.score, sentiment.magnitude<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><a href="https://github.com/GoogleCloudPlatform/python-docs-samples/tree/master/language/movie_nl">https://github.com/GoogleCloudPlatform/python-docs-samples/tree/master/language/movie_nl</a></li>

<li>GCLOUD example:</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">gcloud ml language analyze-entities --content=<span style="color: #E6DB74;">"Michelangelo Caravaggio, Italian painter, is known for 'The Calling of Saint Matthew'."</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="done DONE">DONE</span> SDK</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li><a href="https://cloud.google.com/sdk/docs/quickstart-linux">https://cloud.google.com/sdk/docs/quickstart-linux</a></li>
<li>key:</li>
</ul>
<p>
<a href="https://console.cloud.google.com/iam-admin/serviceaccounts/project?project=reports-174211">https://console.cloud.google.com/iam-admin/serviceaccounts/project?project=reports-174211</a>
</p>
<ul class="org-ul">
<li>初始化SDK
<ul class="org-ul">
<li>配置网络代理</li>
<li>输入代理IP地址:127.0.0.1，代理端口：1080</li>
</ul></li>
<li>授权SDK
<ul class="org-ul">
<li>gcloud auth application-default login</li>
</ul></li>

<li>auth</li>
</ul>
<p>
<a href="https://developers.google.com/identity/protocols/application-default-credentials">https://developers.google.com/identity/protocols/application-default-credentials</a>
</p>
<div class="org-src-container">

<pre class="src src-json"></pre>
</div>

<ul class="org-ul">
<li>gcloud config list</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #AE81FF;">(</span>C:\Users\gft\Anaconda2<span style="color: #AE81FF;">)</span> C:\Users\gft\Documents\Python Scripts\sentiment&gt;gcloud
config list
<span style="color: #AE81FF;">[</span>compute<span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">region</span> = us-east1
<span style="color: #FD971F;">zone</span> = us-east1-d
<span style="color: #AE81FF;">[</span>core<span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">account</span> = victor.wuv@gmail.com
<span style="color: #FD971F;">disable_usage_reporting</span> = False
<span style="color: #FD971F;">project</span> = reports-174211
<span style="color: #AE81FF;">[</span>proxy<span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">address</span> = <span style="color: #AE81FF;">192.168.1.164</span>
<span style="color: #FD971F;">port</span> = <span style="color: #AE81FF;">1080</span>
<span style="color: #FD971F;">type</span> = http

Your active configuration is: <span style="color: #AE81FF;">[</span>nlp1<span style="color: #AE81FF;">]</span>

<span style="color: #AE81FF;">(</span>C:\Users\gft\Anaconda2<span style="color: #AE81FF;">)</span> C:\Users\gft\Documents\Python Scripts\sentiment&gt;
</pre>
</div>
</div>
</div>
</div>
