Calendar/sentiment.org
** DONE Hidden factor model
CLOSED: [2017-07-26 Wed 10:11]
ICA
- portfolio optimization based on factor model
- non linear constrain on factor model

** DONE connect to Amazon AWS EW2:
CLOSED: [2017-07-26 Wed 10:11]
#+BEGIN_SRC shell
# 1
chmod 400 /path/my-key-pair.pem
# 2
ssh -i "amazon.pem" ec2-user@ec2-54-200-133-176.us-west-2.compute.amazonaws.com
# 3
scp -i "/home/weiwu/Downloads/amazon.pem" ~/projects/sentiment/reports-b56f3f2275a1.json  ec2-user@ec2-54-200-133-176.us-west-2.compute.amazonaws.com:~/projects/sentiment
#+END_SRC
- install Google SDK on AWS EM2
methon 1:
curl https://sdk.cloud.google.com | bash
sudo cp /usr/bin/python2.7 /usr/local/bin/python2.7
sudo `which pip` install --upgrade google-cloud-language

* work plan
SCHEDULED: <2017-07-25 Tue>
** DONE read the book 《自然语言处理综论》
CLOSED: [2017-07-26 Wed 10:11]
not easy to understand this book.
** DONE listen to the open course
CLOSED: [2017-07-26 Wed 10:11]
https://web.stanford.edu/class/cs224n/syllabus.html
** DONE 寻找中文分词开源项目
CLOSED: [2017-07-26 Wed 10:11]
LTP from Harbin Institute of Technology
http://ltp.ai/
http://ltp.readthedocs.io/zh_CN/latest/
http://www.ltp-cloud.com/intro/
** TODO Structure:
分词, 词性标注, Parser
- Tools
CRF++

GIZA

Word2Vec
** TODO Opinion Mining, Sentiment Analysis, and Opinion Spam Detection
https://www.cs.uic.edu/~liub/FBS/sentiment-analysis.html
https://www.cs.uic.edu/~liub/FBS/SentimentAnalysis-and-OpinionMining.pdf
** TODO 目标学习：信息抽取
** 如何在NLP领域快速学会第一个技能？
- 找到一个开源项目，比如机器翻译或者深度学习的项目。
- 理解开源项目的任务，编译通过该项目发布的示范程序，得到与项目示范程序一致的结果。
- 然后再深入理解开源项目示范程序的算法。
- 自己编程实现一下这个示范程序的算法。再按照项目提供的标准测试集测试自己实现的程序。如果输出的结果与项目中出现的结果不一致，就要仔细查验自己的程序，反复修改，直到结果与示范程序基本一致。如果还是不行，就大胆给项目的作者写信请教。
- 在此基础上，再看看自己能否进一步完善算法或者实现，取得比示范程序更好的结果。
** 词性标记集：LTP中采用863词性标注集，其各个词性含义如下表：

| Tag	 | Description	         | Example	    |    |
|-------+-----------------------+--------------+----|
| a	   | adjective	           | 美丽	       |    |
| b	   | other noun-modifier	 | 大型 ,西式	 |    |
| c	   | conjunction	         | 和,虽然	    |    |
| d	   | adverb	              | 很           | 	 |
| e	   | exclamation	         | 哎	         |    |
| g	   | morpheme	            | 茨, 甥	     |    |
| h	   | prefix	              | 阿, 伪       | 	 |
| i	   | idiom	               | 百花齐放	   |    |
| j	   | abbreviation	        | 公检法	     |    |
| k	   | suffix	              | 界, 率	     |    |
| m	   | number	              | 一, 第一	   |    |
| n	   | general noun	        | 苹果	       |    |
| nd	  | direction noun	      | 右侧	       |    |
| nh	  | person name	         | 杜甫, 汤姆   |    |
| ni	  | organization name	   | 保险公司     |    |
| nl	  | location noun	       | 城郊         |    |
| ns	  | geographical name	   | 北京         |    |
| nt	  | temporal noun	       | 近日, 明代   |    |
| nz	  | other proper   noun	 | 诺贝尔奖     |    |
| o	   | onomatopoeia	        | 哗啦         |    |
| p	   | preposition	         | 在, 把       |    |
| q	   | quantity	            | 个           |    |
| u	   | auxiliary	           | 的, 地       |    |
| v	   | verb	                | 跑, 学习     |    |
| wp	  | punctuation	         | ，。！       |    |
| ws	  | foreign words	       | CPU          |    |
| x	   | non-lexeme	          | 萄, 翱       |    |
** 命名实体识别
命名实体识别 (Named Entity Recognition, NER) 是在句子的词序列中定位并识别人名、地名、机构名等实体的任务。 如之前的例子，命名实体识别的结果是：

国务院 (机构名) 总理李克强 (人名) 调研上海外高桥 (地名) 时提出，支持上海 (地名) 积极探索新机制。
命名实体识别对于挖掘文本中的实体进而对其进行分析有很重要的作用。
** 依存句法分析
依存语法 (Dependency Parsing, DP) 通过分析语言单位内成分之间的依存关系揭示其句法结构。 直观来讲，依存句法分析识别句子中的“主谓宾”、“定状补”这些语法成分，并分析各成分之间的关 系。
** 语义角色标注
语义角色标注 (Semantic Role Labeling, SRL) 是一种浅层的语义分析技术，标注句子中某些短语为给定谓词的论元 (语义角色) ，如施事、受事、时间和地点等。其能够对问答系统、信息抽取和机器翻译等应用产生推动作用。
* TODO Finish Sentiment book
SCHEDULED: <2017-07-26 Wed>

* DONE factor exposure with CVXPY model
CLOSED: [2017-07-27 Thu 19:10] SCHEDULED: <2017-07-27 Thu>
