docs/Calendar/sentiment.html

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">work plan</h2>
<div class="outline-text-2" id="text-orgheadline11">
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="done DONE">DONE</span> Hidden factor model</h3>
<div class="outline-text-3" id="text-orgheadline12">
<p>
ICA
</p>
<ul class="org-ul">
<li>portfolio optimization based on factor model</li>
<li>non linear constrain on factor model</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="done DONE">DONE</span> connect to Amazon AWS EW2:</h3>
<div class="outline-text-3" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #75715E;"># </span><span style="color: #75715E;">1</span>
chmod <span style="color: #AE81FF;">400</span> /path/my-key-pair.pem
<span style="color: #75715E;"># </span><span style="color: #75715E;">2</span>
ssh -i <span style="color: #E6DB74;">"amazon.pem"</span> ec2-user@ec2-54-200-133-176.us-west-2.compute.amazonaws.com
<span style="color: #75715E;"># </span><span style="color: #75715E;">3</span>
scp -i <span style="color: #E6DB74;">"/home/weiwu/Downloads/amazon.pem"</span> ~/projects/sentiment/reports-b56f3f2275a1.json  ec2-user@ec2-54-200-133-176.us-west-2.compute.amazonaws.com:~/projects/sentiment
</pre>
</div>
<ul class="org-ul">
<li>install Google SDK on AWS EM2</li>
</ul>
<p>
methon 1:
curl <a href="https://sdk.cloud.google.com/">https://sdk.cloud.google.com/</a> | bash
sudo cp /usr/bin/python2.7 /usr/local/bin/python2.7
sudo `which pip` install &#x2013;upgrade google-cloud-language
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">work plan</h2>
<div class="outline-text-2" id="text-orgheadline14">
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="done DONE">DONE</span> read the book 《自然语言处理综论》</h3>
<div class="outline-text-3" id="text-orgheadline15">
<p>
not easy to understand this book.
</p>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="done DONE">DONE</span> listen to the open course</h3>
<div class="outline-text-3" id="text-orgheadline16">
<p>
<a href="https://web.stanford.edu/class/cs224n/syllabus.html">https://web.stanford.edu/class/cs224n/syllabus.html</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="done DONE">DONE</span> 寻找中文分词开源项目</h3>
<div class="outline-text-3" id="text-orgheadline17">
<p>
LTP from Harbin Institute of Technology
<a href="http://ltp.ai/">http://ltp.ai/</a>
<a href="http://ltp.readthedocs.io/zh_CN/latest/">http://ltp.readthedocs.io/zh_CN/latest/</a>
<a href="http://www.ltp-cloud.com/intro/">http://www.ltp-cloud.com/intro/</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="todo TODO">TODO</span> Structure:</h3>
<div class="outline-text-3" id="text-orgheadline18">
<p>
分词, 词性标注, Parser
</p>
<ul class="org-ul">
<li>Tools</li>
</ul>
<p>
CRF++
</p>

<p>
GIZA
</p>

<p>
Word2Vec
</p>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="todo TODO">TODO</span> Opinion Mining, Sentiment Analysis, and Opinion Spam Detection</h3>
<div class="outline-text-3" id="text-orgheadline19">
<p>
<a href="https://www.cs.uic.edu/~liub/FBS/sentiment-analysis.html">https://www.cs.uic.edu/~liub/FBS/sentiment-analysis.html</a>
<a href="https://www.cs.uic.edu/~liub/FBS/SentimentAnalysis-and-OpinionMining.pdf">https://www.cs.uic.edu/~liub/FBS/SentimentAnalysis-and-OpinionMining.pdf</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="todo TODO">TODO</span> 目标学习：信息抽取</h3>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">如何在NLP领域快速学会第一个技能？</h3>
<div class="outline-text-3" id="text-orgheadline21">
<ul class="org-ul">
<li>找到一个开源项目，比如机器翻译或者深度学习的项目。</li>
<li>理解开源项目的任务，编译通过该项目发布的示范程序，得到与项目示范程序一致的结果。</li>
<li>然后再深入理解开源项目示范程序的算法。</li>
<li>自己编程实现一下这个示范程序的算法。再按照项目提供的标准测试集测试自己实现的程序。如果输出的结果与项目中出现的结果不一致，就要仔细查验自己的程序，反复修改，直到结果与示范程序基本一致。如果还是不行，就大胆给项目的作者写信请教。</li>
<li>在此基础上，再看看自己能否进一步完善算法或者实现，取得比示范程序更好的结果。</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">词性标记集：LTP中采用863词性标注集，其各个词性含义如下表：</h3>
<div class="outline-text-3" id="text-orgheadline22">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tag</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-left">adjective</td>
<td class="org-left">美丽</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">other noun-modifier</td>
<td class="org-left">大型 ,西式</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">conjunction</td>
<td class="org-left">和,虽然</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">adverb</td>
<td class="org-left">很</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">exclamation</td>
<td class="org-left">哎</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">morpheme</td>
<td class="org-left">茨, 甥</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">prefix</td>
<td class="org-left">阿, 伪</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">idiom</td>
<td class="org-left">百花齐放</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">j</td>
<td class="org-left">abbreviation</td>
<td class="org-left">公检法</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">suffix</td>
<td class="org-left">界, 率</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">number</td>
<td class="org-left">一, 第一</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">general noun</td>
<td class="org-left">苹果</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nd</td>
<td class="org-left">direction noun</td>
<td class="org-left">右侧</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nh</td>
<td class="org-left">person name</td>
<td class="org-left">杜甫, 汤姆</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ni</td>
<td class="org-left">organization name</td>
<td class="org-left">保险公司</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nl</td>
<td class="org-left">location noun</td>
<td class="org-left">城郊</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ns</td>
<td class="org-left">geographical name</td>
<td class="org-left">北京</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nt</td>
<td class="org-left">temporal noun</td>
<td class="org-left">近日, 明代</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nz</td>
<td class="org-left">other proper   noun</td>
<td class="org-left">诺贝尔奖</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">onomatopoeia</td>
<td class="org-left">哗啦</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">preposition</td>
<td class="org-left">在, 把</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">q</td>
<td class="org-left">quantity</td>
<td class="org-left">个</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">auxiliary</td>
<td class="org-left">的, 地</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">verb</td>
<td class="org-left">跑, 学习</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wp</td>
<td class="org-left">punctuation</td>
<td class="org-left">，。！</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ws</td>
<td class="org-left">foreign words</td>
<td class="org-left">CPU</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">non-lexeme</td>
<td class="org-left">萄, 翱</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">命名实体识别</h3>
<div class="outline-text-3" id="text-orgheadline23">
<p>
命名实体识别 (Named Entity Recognition, NER) 是在句子的词序列中定位并识别人名、地名、机构名等实体的任务。 如之前的例子，命名实体识别的结果是：
</p>

<p>
国务院 (机构名) 总理李克强 (人名) 调研上海外高桥 (地名) 时提出，支持上海 (地名) 积极探索新机制。
命名实体识别对于挖掘文本中的实体进而对其进行分析有很重要的作用。
</p>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24">依存句法分析</h3>
<div class="outline-text-3" id="text-orgheadline24">
<p>
依存语法 (Dependency Parsing, DP) 通过分析语言单位内成分之间的依存关系揭示其句法结构。 直观来讲，依存句法分析识别句子中的“主谓宾”、“定状补”这些语法成分，并分析各成分之间的关 系。
</p>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">语义角色标注</h3>
<div class="outline-text-3" id="text-orgheadline25">
<p>
语义角色标注 (Semantic Role Labeling, SRL) 是一种浅层的语义分析技术，标注句子中某些短语为给定谓词的论元 (语义角色) ，如施事、受事、时间和地点等。其能够对问答系统、信息抽取和机器翻译等应用产生推动作用。
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="todo TODO">TODO</span> Finish Sentiment book</h2>
<div class="outline-text-2" id="text-orgheadline26">
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="done DONE">DONE</span> factor exposure with CVXPY model</h2>
<div class="outline-text-2" id="text-orgheadline27">
</div>
