docs/Calendar/sentiment.html
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">Classical (Markowitz) portfolio optimization</h3>
<div class="outline-text-3" id="text-orgheadline28">
<p>
Classical (Markowitz) portfolio optimization solves the optimization problem
</p>

<p>
maximize μTw−γwTΣw
</p>

<p>
subject to 1Tw=1,w∈W,
</p>

<p>
where w∈Rnw∈Rn is the optimization variable, WW is a set of allowed portfolios (e.g., W=Rn+W=R+n for a long only portfolio), and γ&gt;0γ&gt;0 is the risk aversion parameter.
</p>

<p>
The objective μTw−γwTΣwμTw−γwTΣw is the risk-adjusted return. Varying γγ gives the optimal risk-return trade-off. We can get the same risk-return trade-off by fixing return and minimizing risk.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">Long only portfolio optimization.</span>
<span style="color: #F92672;">from</span> cvxpy <span style="color: #F92672;">import</span> *
<span style="color: #FD971F;">w</span> = Variable<span style="color: #AE81FF;">(</span>n<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">gamma</span> = Parameter<span style="color: #AE81FF;">(</span>sign=<span style="color: #E6DB74;">'positive'</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">ret</span> = mu.T*w
<span style="color: #FD971F;">risk</span> = quad_form<span style="color: #AE81FF;">(</span>w, Sigma<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">prob</span> = Problem<span style="color: #AE81FF;">(</span>Maximize<span style="color: #66D9EF;">(</span>ret - gamma*risk<span style="color: #66D9EF;">)</span>,
               <span style="color: #66D9EF;">[</span>sum_entries<span style="color: #A6E22E;">(</span>w<span style="color: #A6E22E;">)</span> == <span style="color: #AE81FF;">1</span>,
                w &gt;= <span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Compute trade-off curve.</span>
<span style="color: #FD971F;">SAMPLES</span> = <span style="color: #AE81FF;">100</span>
<span style="color: #FD971F;">risk_data</span> = np.zeros<span style="color: #AE81FF;">(</span>SAMPLES<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">ret_data</span> = np.zeros<span style="color: #AE81FF;">(</span>SAMPLES<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">gamma_vals</span> = np.logspace<span style="color: #AE81FF;">(</span>-<span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span>, num=SAMPLES<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">for</span> i <span style="color: #F92672;">in</span> <span style="color: #F92672;">range</span><span style="color: #AE81FF;">(</span>SAMPLES<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">gamma.value</span> = gamma_vals<span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span>
    prob.solve<span style="color: #AE81FF;">()</span>
    <span style="color: #FD971F;">risk_data</span><span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span> = sqrt<span style="color: #AE81FF;">(</span>risk<span style="color: #AE81FF;">)</span>.value
    <span style="color: #FD971F;">ret_data</span><span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span> = ret.value
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">Portfolio constraints</h3>
<div class="outline-text-3" id="text-orgheadline29">
<p>
There are many other possible portfolio constraints besides the long only constraint. With no constraint (W=RnW=Rn), the optimization problem has a simple analytical solution. We will look in detail at a leverage limit, or the constraint that ∥w∥1≤Lmax‖w‖1≤Lmax.
</p>

<p>
Another interesting constraint is the market neutral constraint mTΣw=0, where mi is the capitalization of asset ii. M=mTr is the market return, and mTΣw=cov(M,R). The market neutral constraint ensures that the portfolio return is uncorrelated with the market return.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">Portfolio optimization with leverage limit.</span>
<span style="color: #FD971F;">Lmax</span> = Parameter<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">prob</span> = Problem<span style="color: #AE81FF;">(</span>Maximize<span style="color: #66D9EF;">(</span>ret - gamma*risk<span style="color: #66D9EF;">)</span>,
               <span style="color: #66D9EF;">[</span>sum_entries<span style="color: #A6E22E;">(</span>w<span style="color: #A6E22E;">)</span> == <span style="color: #AE81FF;">1</span>,
                norm<span style="color: #A6E22E;">(</span>w, <span style="color: #AE81FF;">1</span><span style="color: #A6E22E;">)</span> &lt;= Lmax<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Compute trade-off curve for each leverage limit.</span>
<span style="color: #FD971F;">L_vals</span> = <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">]</span>
<span style="color: #FD971F;">SAMPLES</span> = <span style="color: #AE81FF;">100</span>
<span style="color: #FD971F;">risk_data</span> = np.zeros<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">len</span><span style="color: #A6E22E;">(</span>L_vals<span style="color: #A6E22E;">)</span>, SAMPLES<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">ret_data</span> = np.zeros<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">len</span><span style="color: #A6E22E;">(</span>L_vals<span style="color: #A6E22E;">)</span>, SAMPLES<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">gamma_vals</span> = np.logspace<span style="color: #AE81FF;">(</span>-<span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span>, num=SAMPLES<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">w_vals</span> = <span style="color: #AE81FF;">[]</span>
<span style="color: #F92672;">for</span> k, L_val <span style="color: #F92672;">in</span> <span style="color: #F92672;">enumerate</span><span style="color: #AE81FF;">(</span>L_vals<span style="color: #AE81FF;">)</span>:
    <span style="color: #F92672;">for</span> i <span style="color: #F92672;">in</span> <span style="color: #F92672;">range</span><span style="color: #AE81FF;">(</span>SAMPLES<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">Lmax.value</span> = L_val
        <span style="color: #FD971F;">gamma.value</span> = gamma_vals<span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span>
        prob.solve<span style="color: #AE81FF;">()</span>
        <span style="color: #FD971F;">risk_data</span><span style="color: #AE81FF;">[</span>k, i<span style="color: #AE81FF;">]</span> = sqrt<span style="color: #AE81FF;">(</span>risk<span style="color: #AE81FF;">)</span>.value
        <span style="color: #FD971F;">ret_data</span><span style="color: #AE81FF;">[</span>k, i<span style="color: #AE81FF;">]</span> = ret.value
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30">Multi-Period Trading via Convex Optimization</h3>
<div class="outline-text-3" id="text-orgheadline30">
<p>
<a href="https://web.stanford.edu/~boyd/papers/cvx_portfolio.html">link<sub>to</sub><sub>the</sub><sub>author</sub><sub>website</sub></a>
<a href="https://github.com/cvxgrp/cvxportfolio">github<sub>link</sub></a>
</p>

<p>
book:
To appear, Foundations and Trends in Optimization, 2017
<a href="https://web.stanford.edu/~boyd/papers/cvx_portfolio.html">manual</a>
</p>

<ul class="org-ul">
<li>a framework for single-period optimization, where the trades in each period are found by solving a convex optimization problem that trades off expected return, risk, transaction costs and holding costs such as the borrowing cost for shorting assets.</li>
<li>a multi-period version of the trading method, where optimization is used to plan a sequence of trades, with only the first one executed, using estimates of future quantities that are unknown when the trades are chosen.</li>
<li>The single-period method traces back to Markowitz;</li>
<li>the multi-period methods trace back to model predictive control.</li>
</ul>

<p>
Our contribution is to describe the single-period and multi-period methods in one simple framework, giving a clear description of the development and the approximations made. In this paper we do not address a critical component in a trading algorithm, the predictions or forecasts of future quantities. The methods we describe in this paper can be thought of as good ways to exploit predictions, no matter how the forecasts are made. We have also developed a companion open-source software library that implements many of the ideas and methods described in the paper.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="todo TODO">TODO</span> 在GS上部署因子中性, CVXPORTOLIO的使用说明。</h2>
<div class="outline-text-2" id="text-orgheadline32">
</div><div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">Multi-Period optimization</h3>
<div class="outline-text-3" id="text-orgheadline31">
<ul class="org-ul">
<li>D. Bertsekas. Dynamic Programming and Optimal Control. Athena Scientific, 1995.</li>
<li>J. Campbell and L. Viceira. Strategic Asset Allocation: Portfolio Choice for Long-Term Investors. Oxford University Press, 2002.</li>

<li>Information and Sharpe ratio.</li>
</ul>
<p>
The (realized) information ratio (IR) of the portfolio relative to a benchmark is the average of the active returns Ra over the standard deviation of the active returns σa, IR = Ra/σa. In the special case of a cash benchmark this is known as Sharpe ratio (SR) SR = Re/σe.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
